# DRY

name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым 2020 годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
name = 'Иван'
print(f'Дорогой, {name}, с Новым годом!')
